# CannotCreateFasciaError Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CreationFailures..::..CannotCreateFasciaError Property
BuiltInFailures..::..CreationFailures Class See Also
---
Could not create Fascia. [Description]
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotCreateFasciaError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotCreateFasciaError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotCreateFasciaError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CreationFailures Class
Autodesk.Revit.DB Namespace